melt() -- Wide to Long

In [2]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85,78,92],
    'Science': [90,82,89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the dataframe 
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [3]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

But if we want to "melt" the dataframe so that each row represents a student-subject pair, we can do

# Basically this is the format  of the ,melt function that we are going to use and on the basis of the column and the row we are going to change

df.melt(id_vars=None, value_vars=None, var_name=None, value_name="value", col_level=None)  --  look for each value we have write none beeacus on that place and when ever we are goint o use that we need to give that column or row name instead of that none

In [4]:
df.melt(id_vars=['Name'], value_vars = ['Math', 'Science', 'English'], var_name = "Subject", value_name = "Score")

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

# Pivot method  ---- 
1. Basically it will throw an error if there is any dupicate value present in the data

We can use pivot_table() to aggregate values (e.g., taking the mean for duplicate entries).

In [5]:
df.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")

KeyError: 'Score'

1. Use melt() to go long, pivot() to go wide
2. pivot() is used to turn long-format data into wide-format by spreading unique column values into seprate columns